DynamicUnet
======================================================================
Layer (type)         Output Shape         Param #    Trainable 
======================================================================
Conv2d               [64, 64, 64]         9,408      False     
______________________________________________________________________
BatchNorm2d          [64, 64, 64]         128        True      
______________________________________________________________________
ReLU                 [64, 64, 64]         0          False     
______________________________________________________________________
MaxPool2d            [64, 32, 32]         0          False     
______________________________________________________________________
Conv2d               [64, 32, 32]         36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
ReLU                 [64, 32, 32]         0          False     
______________________________________________________________________
Conv2d               [64, 32, 32]         36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
Conv2d               [64, 32, 32]         36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
ReLU                 [64, 32, 32]         0          False     
______________________________________________________________________
Conv2d               [64, 32, 32]         36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
Conv2d               [64, 32, 32]         36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
ReLU                 [64, 32, 32]         0          False     
______________________________________________________________________
Conv2d               [64, 32, 32]         36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
Conv2d               [128, 16, 16]        73,728     False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
ReLU                 [128, 16, 16]        0          False     
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
Conv2d               [128, 16, 16]        8,192      False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
ReLU                 [128, 16, 16]        0          False     
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
ReLU                 [128, 16, 16]        0          False     
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
ReLU                 [128, 16, 16]        0          False     
______________________________________________________________________
Conv2d               [128, 16, 16]        147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          294,912    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
ReLU                 [256, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          32,768     False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
ReLU                 [256, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
ReLU                 [256, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
ReLU                 [256, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
ReLU                 [256, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
ReLU                 [256, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [256, 8, 8]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [512, 4, 4]          1,179,648  False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
ReLU                 [512, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [512, 4, 4]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
Conv2d               [512, 4, 4]          131,072    False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
Conv2d               [512, 4, 4]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
ReLU                 [512, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [512, 4, 4]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
Conv2d               [512, 4, 4]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
ReLU                 [512, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [512, 4, 4]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
BatchNorm2d          [512, 4, 4]          1,024      True      
______________________________________________________________________
ReLU                 [512, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [1024, 4, 4]         4,719,616  True      
______________________________________________________________________
ReLU                 [1024, 4, 4]         0          False     
______________________________________________________________________
Conv2d               [512, 4, 4]          4,719,104  True      
______________________________________________________________________
ReLU                 [512, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [1024, 4, 4]         525,312    True      
______________________________________________________________________
PixelShuffle         [256, 8, 8]          0          False     
______________________________________________________________________
ReLU                 [1024, 4, 4]         0          False     
______________________________________________________________________
BatchNorm2d          [256, 8, 8]          512        True      
______________________________________________________________________
Conv2d               [512, 8, 8]          2,359,808  True      
______________________________________________________________________
ReLU                 [512, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [512, 8, 8]          2,359,808  True      
______________________________________________________________________
ReLU                 [512, 8, 8]          0          False     
______________________________________________________________________
ReLU                 [512, 8, 8]          0          False     
______________________________________________________________________
Conv2d               [1024, 8, 8]         525,312    True      
______________________________________________________________________
PixelShuffle         [256, 16, 16]        0          False     
______________________________________________________________________
ReLU                 [1024, 8, 8]         0          False     
______________________________________________________________________
BatchNorm2d          [128, 16, 16]        256        True      
______________________________________________________________________
Conv2d               [384, 16, 16]        1,327,488  True      
______________________________________________________________________
ReLU                 [384, 16, 16]        0          False     
______________________________________________________________________
Conv2d               [384, 16, 16]        1,327,488  True      
______________________________________________________________________
ReLU                 [384, 16, 16]        0          False     
______________________________________________________________________
ReLU                 [384, 16, 16]        0          False     
______________________________________________________________________
Conv2d               [768, 16, 16]        295,680    True      
______________________________________________________________________
PixelShuffle         [192, 32, 32]        0          False     
______________________________________________________________________
ReLU                 [768, 16, 16]        0          False     
______________________________________________________________________
BatchNorm2d          [64, 32, 32]         128        True      
______________________________________________________________________
Conv2d               [256, 32, 32]        590,080    True      
______________________________________________________________________
ReLU                 [256, 32, 32]        0          False     
______________________________________________________________________
Conv2d               [256, 32, 32]        590,080    True      
______________________________________________________________________
ReLU                 [256, 32, 32]        0          False     
______________________________________________________________________
ReLU                 [256, 32, 32]        0          False     
______________________________________________________________________
Conv2d               [512, 32, 32]        131,584    True      
______________________________________________________________________
PixelShuffle         [128, 64, 64]        0          False     
______________________________________________________________________
ReLU                 [512, 32, 32]        0          False     
______________________________________________________________________
BatchNorm2d          [64, 64, 64]         128        True      
______________________________________________________________________
Conv2d               [96, 64, 64]         165,984    True      
______________________________________________________________________
ReLU                 [96, 64, 64]         0          False     
______________________________________________________________________
Conv2d               [96, 64, 64]         83,040     True      
______________________________________________________________________
ReLU                 [96, 64, 64]         0          False     
______________________________________________________________________
ReLU                 [192, 64, 64]        0          False     
______________________________________________________________________
Conv2d               [384, 64, 64]        37,248     True      
______________________________________________________________________
PixelShuffle         [96, 128, 128]       0          False     
______________________________________________________________________
ReLU                 [384, 64, 64]        0          False     
______________________________________________________________________
MergeLayer           [99, 128, 128]       0          False     
______________________________________________________________________
Conv2d               [99, 128, 128]       88,308     True      
______________________________________________________________________
ReLU                 [99, 128, 128]       0          False     
______________________________________________________________________
Conv2d               [99, 128, 128]       88,308     True      
______________________________________________________________________
ReLU                 [99, 128, 128]       0          False     
______________________________________________________________________
MergeLayer           [99, 128, 128]       0          False     
______________________________________________________________________
Conv2d               [4, 128, 128]        400        True      
______________________________________________________________________

Total params: 41,221,368
Total trainable params: 19,953,720
Total non-trainable params: 21,267,648
Optimized with 'torch.optim.adam.Adam', betas=(0.9, 0.99)
Using true weight decay as discussed in https://www.fast.ai/2018/07/02/adam-weight-decay/ 
Loss function : FlattenedLoss
======================================================================
Callbacks functions applied 

